# Flip Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementFromToCalculationPoints..::..Flip Method
SpatialElementFromToCalculationPoints Class See Also
---
flip the direction of the "from" and "to" points
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Flip()
```

Visual Basic
---
```text
Public Sub Flip
```

Visual C++
---
```text
public:
void Flip()
```

# See Also
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace